[
    {
       "Name": "Hope",
       "Description": "I am mostly inspired by the richness of the natural world and the complexities of modern day life, in Elemental Realms give the fullest possible expression to the human delight in exploring the universe and ourselves. Continually pushing the boundaries, I am at the forefront of what it means to be creative in our time. I presents fine entanglements of the trees and the flora with the whole nature itself. At some point in our life all of experience extremely stressful situations, which shake our very core. My latest collection is so bright, and inspirational, providing hope and peace, which gives me positive and reassuring feedback, again much needed in difficult circumstances. ,,The Healing Power of art,, I find to be 100% accurate.",
       "PictureUrl": "images/Hope.png"
    },
    {
        "Name": "Trees",
        "Description": "A collection of trees created in my signature style. In this series I presents fine entanglements of the trees and the flora with the whole nature itself (specially with the flora). Created is an inspiring and challenging aiming at presentation of our positioning in the jungle of situations and possibilities, grown up with the rapidly changing modern life. Infused with dreamlike visions of the spiritual and an unbreakable connection with the natural world, Mira Mitrova’s creations recall subconscious mysteries buried deep in legend and folklore. FREEDOM",
        "PictureUrl": "images/Trees.png"
      },
      {
        "Name": "Ocean",
        "Description": "My vision conceptualizes a communion of surrender and realization. Infused with dreamlike visions of the spiritual and an unbreakable connection with the natural world. My creations recall subconscious mysteries buried deep in legend and folklore. Through the use of several different media including graphics, oil painting, acrylic painting, mix media painting and photography, I considers life as a combination of challenge and possibility. In exploring themes such as isolation, imprisonment and commoditization, I provides a visual treatise on the human capacity to be proactive in asserting spiritual freedom in the face of situational desolation.",
        "PictureUrl": "images/Ocean.png"
      },
      {
        "Name": "Entanglement",
        "Description": "In this series of oil paintings, I present fine entanglements of the portrait and the body with the whole nature itself (specially with the flora). Created is an inspiring and challenging aiming at presentation of our positioning in the jungle of situations and possibilities, grown up with the rapidly changing modern life. Fear of the unknown, fear of the invisible, dreams, illusions, love and erotica flow out of the paintings. Each painting has a specific relation, a kind of particularity, a kind of emotional approach. My vision conceptualizes a communion of surrender and realization. Infused with dreamlike visions of the spiritual and an unbreakable connection with the natural world, Mira Mitrova’s creations recall subconscious mysteries buried deep in legend and folklore.",
        "PictureUrl": "images/Enatanglement.png"
      },
      {
        "Name": "Colorful Earth",
        "Description": "Created is an inspiring and challenging aiming at presentation of our positioning in the world of situations and possibilities, grown up with the rapidly changing modern life. I WILL SAY I want a life full of color. I’m tired of gray, of situensans with storms. All I want is to be like a butterfly and be reborn with bright, celebratory colors and to walk on colorful planet full of positive feeling! On the abstract paintings, one can find empty space above the landscapes with waves water, ports, earth, strange buildings, planet, aliens, sport shoe that is ready to move etc.",
        "PictureUrl": "images/Colorful-earth.png"
      },
      {
        "Name": "New Planet",
        "Description": "In this series of oil paintings, I present fine entanglements of the portrait and the body with the whole nature itself (specially with the flora). Created is an inspiring and challenging aiming at presentation of our positioning in the jungle of situations and possibilities, grown up with the rapidly changing modern life. Fear of the unknown, fear of the invisible, dreams, illusions, love and erotica flow out of the paintings. Each painting has a specific relation, a kind of particularity, a kind of emotional approach. My vision conceptualizes a communion of surrender and realization. Infused with dreamlike visions of the spiritual and an unbreakable connection with the natural world, Mira Mitrova’s creations recall subconscious mysteries buried deep in legend and folklore.",
        "PictureUrl": "images/New-planet.png"
      },
      {
        "Name": "New Life",
        "Description": "In this series of oil paintings, I present fine entanglements of the portrait and the body with the whole nature itself (specially with the flora). Created is an inspiring and challenging aiming at presentation of our positioning in the jungle of situations and possibilities, grown up with the rapidly changing modern life. Fear of the unknown, fear of the invisible, dreams, illusions, love and erotica flow out of the paintings. Each painting has a specific relation, a kind of particularity, a kind of emotional approach. My vision conceptualizes a communion of surrender and realization. Infused with dreamlike visions of the spiritual and an unbreakable connection with the natural world, Mira Mitrova’s creations recall subconscious mysteries buried deep in legend and folklore.",
        "PictureUrl": "images/New-Life.png"
      }
    ]